TanaseDoru/FRDM_Pong/MKL25Z4_Proiect_MP/source/MKL25Z4_Proiect_MP.c
// Frecvente note muzicale (Hz) - pentru melodia "The Metro" in B minor
// Frecvente note muzicale (Hz) - TEST frecvente joase
#define NOTE_B2   150   // Foarte grav
#define NOTE_C3   160
#define NOTE_D3   170
#define NOTE_E2   130
#define NOTE_FS2  140
#define NOTE_G2   145
#define NOTE_A2   155
#define NOTE_B3   180
#define NOTE_REST 0

// Variabila globala pentru starea sunetului
static volatile uint8_t g_sound_enabled = 1;

/*============================================================================
 * CONFIGURARE IR REMOTE
 *============================================================================*/

#define IR_PIN 12u
#define IR_GPIO GPIOA
#define IR_PORT PORTA
#define IR_IRQ  PORTA_IRQn

#define TICKS_US_FACTOR      1.5f
#define NEC_HDR_MARK_MIN     12000
#define NEC_HDR_SPACE_MIN    6000
#define NEC_BIT_THRESHOLD    2500
#define GLITCH_THRESHOLD     100

volatile uint32_t ir_code = 0;
volatile uint8_t ir_ready = 0;
volatile uint32_t pulse_count = 0;
volatile uint32_t pulse_buffer[100];
volatile uint8_t capture_complete = 0;
volatile uint32_t last_ir_code = 0;
volatile uint32_t last_ir_time = 0;

/* === NOU: Stare IR pentru gameplay === */
static int8_t g_ir_current_direction = 0;
static uint32_t g_ir_last_input_time = 0;
#define IR_INPUT_TIMEOUT_MS  150

#define IR_DEBOUNCE_MS 200
#define IR_GAME_DEBOUNCE_MS 80

#define IR_KEY_UP       0xE718FF00
#define IR_KEY_DOWN     0xAD52FF00
#define IR_KEY_LEFT     0xF708FF00
#define IR_KEY_RIGHT    0xA55AFF00
#define IR_KEY_OK       0xE31CFF00
#define IR_KEY_POWER    0xBA45FF00
#define IR_KEY_BACK     0xF807FF00

/*============================================================================
 * CONSTANTE PENTRU UI
 *============================================================================*/

#define MENU_START_Y      35
#define MENU_ITEM_HEIGHT  14
#define MENU_MARGIN_X     10
#define TITLE_Y           8

#define COLOR_BG          COLOR_BLACK
#define COLOR_TITLE       COLOR_CYAN
#define COLOR_NORMAL      COLOR_WHITE
#define COLOR_SELECTED    COLOR_YELLOW
#define COLOR_DISABLED    COLOR_GRAY
#define COLOR_HIGHLIGHT   COLOR_GREEN
#define COLOR_BACK        COLOR_ORANGE

/*============================================================================
 * TIMING CU PIT PENTRU UPDATE FPS
 *============================================================================*/

volatile uint8_t g_game_tick = 0;   // se seteaza la fiecare 20 ms (GAME_FRAME_MS)
volatile uint8_t g_menu_tick = 0;   // se seteaza la fiecare 50 ms (MENU_FRAME_MS)
#define GAME_FRAME_MS 20
#define MENU_FRAME_MS 50


/*============================================================================
 * SYSTICK TIMER
 *============================================================================*/

static volatile uint32_t g_systick_ms = 0;

void SysTick_Handler(void) {
    g_systick_ms++;
}

void Timer_Init(void) {
    SysTick_Config(SystemCoreClock / 1000U);
    PRINTF("Timer initialized (SysTick 1ms)\r\n");
}

uint32_t Timer_GetMs(void) {
    return g_systick_ms;
}

void delay_ms(uint32_t ms) {
    uint32_t start = g_systick_ms;
    while ((g_systick_ms - start) < ms) {
        __WFI();
    }
}

bool Timer_Elapsed(uint32_t start_time, uint32_t duration_ms) {
    return ((g_systick_ms - start_time) >= duration_ms);
}

/*============================================================================
 * PIT TIMER PENTRU GAME/MENU UPDATE
 *============================================================================*/

void PIT_Init(void) {
    /* Clock la modulul PIT */
    SIM->SCGC6 |= SIM_SCGC6_PIT_MASK;

    /* Enable PIT, freeze in debug */
    PIT->MCR &= ~PIT_MCR_MDIS_MASK;
    PIT->MCR |= PIT_MCR_FRZ_MASK;

    /* Frecvența bus clock – pe FRDM-KL25Z tipic este SystemCoreClock/2 */
    uint32_t busClock = SystemCoreClock / 2U;

    /* Perioade în tick-uri pentru ch0 (game) și ch1 (menu) */
    uint32_t gamePeriod = (busClock * GAME_FRAME_MS / 1000U) - 1U;  // ~20ms
    uint32_t menuPeriod = (busClock * MENU_FRAME_MS / 1000U) - 1U;  // ~50ms

    /* Channel 0 – update joc */
    PIT->CHANNEL[0].LDVAL = PIT_LDVAL_TSV(gamePeriod);
    PIT->CHANNEL[0].TCTRL = PIT_TCTRL_TIE_MASK;  // interrupt enable

    /* Channel 1 – update meniu */
    PIT->CHANNEL[1].LDVAL = PIT_LDVAL_TSV(menuPeriod);
    PIT->CHANNEL[1].TCTRL = PIT_TCTRL_TIE_MASK;  // interrupt enable

    /* NVIC pentru PIT (canalele împart același IRQ) */
    NVIC_SetPriority(PIT_IRQn, 3);
    NVIC_ClearPendingIRQ(PIT_IRQn);
    NVIC_EnableIRQ(PIT_IRQn);

    /* Pornim ambele canale */
    PIT->CHANNEL[0].TCTRL |= PIT_TCTRL_TEN_MASK;
    PIT->CHANNEL[1].TCTRL |= PIT_TCTRL_TEN_MASK;

    PRINTF("PIT initialized (CH0=%d ms, CH1=%d ms)\r\n", GAME_FRAME_MS, MENU_FRAME_MS);
}

void PIT_IRQHandler(void) {
    /* Channel 0 – tick pentru gameplay */
    if (PIT->CHANNEL[0].TFLG & PIT_TFLG_TIF_MASK) {
        PIT->CHANNEL[0].TFLG = PIT_TFLG_TIF_MASK;   // clear flag
        g_game_tick = 1;
    }

    /* Channel 1 – tick pentru meniuri */
    if (PIT->CHANNEL[1].TFLG & PIT_TFLG_TIF_MASK) {
        PIT->CHANNEL[1].TFLG = PIT_TFLG_TIF_MASK;   // clear flag
        g_menu_tick = 1;
    }
}


/*============================================================================
 * FUNCTII LED ARCADE
 *============================================================================*/

void LED_Arcade_Init(void) {
    // Enable clock pentru PORTE
    CLOCK_EnableClock(kCLOCK_PortE);

    // Configurare pini ca GPIO output
    PORT_SetPinMux(LED_P1_PORT, LED_P1_PIN, kPORT_MuxAsGpio);
    PORT_SetPinMux(LED_P2_PORT, LED_P2_PIN, kPORT_MuxAsGpio);

    // Configurare ca output, initial OFF (HIGH pentru active-low)
    gpio_pin_config_t led_config = {kGPIO_DigitalOutput, 1};
    GPIO_PinInit(LED_P1_GPIO, LED_P1_PIN, &led_config);
    GPIO_PinInit(LED_P2_GPIO, LED_P2_PIN, &led_config);

    // Test flash la startup - confirma ca LED-urile functioneaza
    LED_P1_ON(); LED_P2_ON();
    delay_ms(150);
    LED_P1_OFF(); LED_P2_OFF();
    delay_ms(100);
    LED_P1_ON(); LED_P2_ON();
    delay_ms(150);
    LED_P1_OFF(); LED_P2_OFF();

    PRINTF("LED Arcade initialized (P1=PTE20, P2=PTE21)\r\n");
}

// Flash pentru gol - numarul de flash-uri = scorul jucatorului
void LED_GoalFlash(uint8_t player, uint8_t score) {
    for (uint8_t i = 0; i < score; i++) {
        if (player == 1) {
            LED_P1_ON();
        } else {
            LED_P2_ON();
        }
        delay_ms(100);
        if (player == 1) {
            LED_P1_OFF();
        } else {
            LED_P2_OFF();
        }
        delay_ms(80);
    }
}

// Flash pentru ambele LED-uri simultan
void LED_BothFlash(uint8_t times, uint16_t on_ms, uint16_t off_ms) {
    for (uint8_t i = 0; i < times; i++) {
        LEDS_BOTH_ON();
        delay_ms(on_ms);
        LEDS_BOTH_OFF();
        delay_ms(off_ms);
    }
}

// Flash alternativ intre cele 2 LED-uri (celebration effect)
void LED_AlternatingFlash(uint8_t times, uint16_t period_ms) {
    for (uint8_t i = 0; i < times; i++) {
        LED_P1_ON(); LED_P2_OFF();
        delay_ms(period_ms);
        LED_P1_OFF(); LED_P2_ON();
        delay_ms(period_ms);
    }
    LED_P2_OFF();
}

// Victory pulse pentru castigator - pulsuri lente
void LED_VictoryPulse(uint8_t winner) {
    for (uint8_t i = 0; i < 5; i++) {
        if (winner == 1) {
            LED_P1_ON();
        } else {
            LED_P2_ON();
        }
        delay_ms(200);
        if (winner == 1) {
            LED_P1_OFF();
        } else {
            LED_P2_OFF();
        }
        delay_ms(150);
    }
}

/*============================================================================
 * FUNCTII BUZZER PIEZO
 *============================================================================*/

void Buzzer_Init(void) {
    // Enable clock pentru PORTB si TPM2
    CLOCK_EnableClock(kCLOCK_PortB);
    CLOCK_EnableClock(kCLOCK_Tpm2);

