TanaseDoru/FRDM_Pong/MKL25Z4_Proiect_MP/source/MKL25Z4_Proiect_MP.c
        if (game.speed_level % 2 == 0) {
            if (ball.dy > 0) ball.dy++;
            else if (ball.dy < 0) ball.dy--;
        }

        ST7735_FillRect(45, 55, 70, 18, COLOR_ORANGE);
        ST7735_DrawRect(45, 55, 70, 18, COLOR_WHITE);
        ST7735_DrawStringCentered(59, "SPEED UP!", COLOR_WHITE, COLOR_ORANGE, 1);
        delay_ms(300);
        ST7735_FillRect(45, 55, 70, 18, COLOR_BLACK);
        Game_RedrawCenterLine();

        PRINTF("[GAME] Speed level: %d\r\n", game.speed_level);
    }

    /* Paleta 1 (stanga) */
        if (IsCPUInput(paddle1.input)) {
            AI_UpdatePaddle(&paddle1, false);
        } else if (paddle1.input == INPUT_JOYSTICK) {
            int16_t joy_y = Joystick_GetY_Percent();
            if (joy_y > 15) paddle1.y += (joy_y / 10);
            else if (joy_y < -15) paddle1.y += (joy_y / 10);
        } else if (paddle1.input == INPUT_REMOTE) {
            int8_t ir_dir = IR_GetCurrentDirection();
            paddle1.y += ir_dir * PADDLE_SPEED;
        } else if (paddle1.input == INPUT_GYROSCOPE) {  // ADAUGĂ
            paddle1.y = Gyro_GetPaddleY();
        }

        /* Paleta 2 (dreapta) */
        if (IsCPUInput(paddle2.input)) {
            AI_UpdatePaddle(&paddle2, true);
        } else if (paddle2.input == INPUT_JOYSTICK) {
            int16_t joy_y = Joystick_GetY_Percent();
            if (joy_y > 15) paddle2.y += (joy_y / 10);
            else if (joy_y < -15) paddle2.y += (joy_y / 10);
        } else if (paddle2.input == INPUT_REMOTE) {
            int8_t ir_dir = IR_GetCurrentDirection();
            paddle2.y += ir_dir * PADDLE_SPEED;
        } else if (paddle2.input == INPUT_GYROSCOPE) {
            int16_t target = Gyro_GetPaddleY();

            // opțional: ignoră dacă nu avem date recente (de exemplu senzor mort)
            if (!Gyro_IsActive()) {
                // nu schimba paleta daca giroscopul nu a mai trimis nimic
                // (sau eventual du-o încet spre centru)
                // return;   // cel mai simplu: lasa paleta unde e
            }

            int16_t dy = target - paddle2.y;

            // dacă diferența e mică, nu mai mișcăm (evită tremuratul fin)
            if (dy > -2 && dy < 2) {
                // nu face nimic, păstrăm poziția curentă
            } else {
                // limitați viteza paletei (de ex. max 3 pixeli pe frame)
                int16_t step = 3;
                if (dy > 0) {
                    if (dy < step) step = dy;
                    paddle2.y += step;
                } else {
                    if (-dy < step) step = -dy;
                    paddle2.y -= step;
                }
            }
        }


    /* Limiteaza pozitiile */
    if (paddle1.y < PADDLE_MIN_Y) paddle1.y = PADDLE_MIN_Y;
    if (paddle1.y > PADDLE_MAX_Y) paddle1.y = PADDLE_MAX_Y;
    if (paddle2.y < PADDLE_MIN_Y) paddle2.y = PADDLE_MIN_Y;
    if (paddle2.y > PADDLE_MAX_Y) paddle2.y = PADDLE_MAX_Y;

    /* Miscare bila */
    ball.x += ball.dx;
    ball.y += ball.dy;

    /* Coliziune sus/jos */
    if (ball.y <= 2) {
        ball.y = 3;
        ball.dy = -ball.dy;
    }
    if (ball.y >= FIELD_HEIGHT - BALL_SIZE - 2) {
        ball.y = FIELD_HEIGHT - BALL_SIZE - 3;
        ball.dy = -ball.dy;
    }

    /* Coliziune Paleta 1 */
    if (ball.dx < 0 && ball.x <= PADDLE_X_P1 + PADDLE_WIDTH + 1 && ball.x >= PADDLE_X_P1) {
        if (ball.y + ball.size >= paddle1.y && ball.y <= paddle1.y + PADDLE_HEIGHT) {
            ball.x = PADDLE_X_P1 + PADDLE_WIDTH + 2;
            ball.dx = -ball.dx;
            int16_t hit_pos = (ball.y + ball.size / 2) - (paddle1.y + PADDLE_HEIGHT / 2);
            ball.dy = hit_pos / 4;
            if (ball.dy == 0) ball.dy = (rand() % 2) ? 1 : -1;
        }
    }

    /* Coliziune Paleta 2 */
    if (ball.dx > 0 && ball.x + ball.size >= PADDLE_X_P2 - 1 && ball.x <= PADDLE_X_P2 + PADDLE_WIDTH) {
        if (ball.y + ball.size >= paddle2.y && ball.y <= paddle2.y + PADDLE_HEIGHT) {
            ball.x = PADDLE_X_P2 - ball.size - 2;
            ball.dx = -ball.dx;
            int16_t hit_pos = (ball.y + ball.size / 2) - (paddle2.y + PADDLE_HEIGHT / 2);
            ball.dy = hit_pos / 4;
            if (ball.dy == 0) ball.dy = (rand() % 2) ? 1 : -1;
        }
    }

    /* Gol stanga - Player 2 marcheaza */
    if (ball.x < -ball.size) {
        paddle2.score++;
        LED_GoalFlash(2, paddle2.score);  // Flash-uri = scorul P2
        Buzzer_GoalSound();  // Sunet gol
        Game_DrawScore();
        if (paddle2.score >= game.winning_score) {
            game.winner = 2;
            game.is_running = 0;
        } else {
            Game_ResetBall();
        }
    }

    /* Gol dreapta - Player 1 marcheaza */
    if (ball.x > FIELD_WIDTH + ball.size) {
        paddle1.score++;
        LED_GoalFlash(1, paddle1.score);  // Flash-uri = scorul P1
        Buzzer_GoalSound();  // Sunet gol
        Game_DrawScore();
        if (paddle1.score >= game.winning_score) {
            game.winner = 1;
            game.is_running = 0;
        } else {
            Game_ResetBall();
        }
    }

    /* Desenare */
    Game_DrawPaddle(&paddle1, PADDLE_X_P1, COLOR_CYAN);
    Game_DrawPaddle(&paddle2, PADDLE_X_P2, COLOR_MAGENTA);
    Game_DrawBall();

    g_ui_timers.last_game_update_time = Timer_GetMs() - start;
}

void Game_Start(void) {
    PRINTF("\r\n=== GAME STARTED ===\r\n");
    PRINTF("P1: %s | P2: %s\r\n", GetInputName(g_player1_input), GetInputName(g_player2_input));

    Game_Init();
    Game_DrawField();
    Game_DrawScore();

    ST7735_FillRect(PADDLE_X_P1, paddle1.y, PADDLE_WIDTH, PADDLE_HEIGHT, COLOR_CYAN);
    ST7735_FillRect(PADDLE_X_P2, paddle2.y, PADDLE_WIDTH, PADDLE_HEIGHT, COLOR_MAGENTA);

    /* === COUNTDOWN CU LED-URI ARCADE === */

    // READY - ambele LED-uri ON
    ST7735_FillRect(40, 50, 80, 30, COLOR_DARK_GRAY);
    ST7735_DrawRect(40, 50, 80, 30, COLOR_YELLOW);
    ST7735_DrawStringCentered(58, "READY", COLOR_YELLOW, COLOR_DARK_GRAY, 2);
    LEDS_BOTH_ON();
    delay_ms(700);

    // 3 - LED P1 flash
    ST7735_FillRect(40, 50, 80, 30, COLOR_DARK_GRAY);
    ST7735_DrawRect(40, 50, 80, 30, COLOR_WHITE);
    ST7735_DrawStringCentered(58, "3", COLOR_WHITE, COLOR_DARK_GRAY, 2);
    LEDS_BOTH_OFF();
    LED_P1_ON();
    delay_ms(400);

    // 2 - LED P2 flash
    ST7735_FillRect(40, 50, 80, 30, COLOR_DARK_GRAY);
    ST7735_DrawRect(40, 50, 80, 30, COLOR_WHITE);
    ST7735_DrawStringCentered(58, "2", COLOR_WHITE, COLOR_DARK_GRAY, 2);
    LED_P1_OFF();
    LED_P2_ON();
    delay_ms(400);

