TanaseDoru/FRDM_Pong/MKL25Z4_Proiect_MP/source/MKL25Z4_Proiect_MP.c
        case SCREEN_SELECT_P2:
            if (g_menuState.selectedIndex == 3) {
                ChangeScreen(SCREEN_SELECT_INPUT);
            } else {
            	InputType_t inputMap[] = {INPUT_JOYSTICK, INPUT_REMOTE, INPUT_GYROSCOPE};
                InputType_t selectedInput = inputMap[g_menuState.selectedIndex];

                if (IsInputAvailable(selectedInput, 2)) {
                    g_player2_input = selectedInput;
                    g_currentScreen = SCREEN_SELECT_INPUT;
                    g_menuState.selectedIndex = 2;
                    g_needsRedraw = 1;
                } else {
                    ST7735_FillRect(20, 105, 120, 20, COLOR_RED);
                    ST7735_DrawRect(20, 105, 120, 20, COLOR_WHITE);
                    ST7735_DrawStringCentered(110, "USED BY P1!", COLOR_WHITE, COLOR_RED, 1);
                    delay_ms(800);
                    g_needsRedraw = 1;
                }
            }
            break;

        case SCREEN_GAME_OVER:
            if (g_menuState.selectedIndex == 0) Game_Start();
            else ChangeScreen(SCREEN_MAIN);
            break;

        default:
            break;
    }
}

/*============================================================================
 * INPUT PROCESSING
 *============================================================================*/

void ProcessMenuInput(void) {
    JoyAction_t joy_action = Joystick_GetMenuAction();
    JoyAction_t ir_action = IR_GetMenuAction();
    JoyAction_t action = (joy_action != JOY_ACTION_NONE) ? joy_action : ir_action;

    switch (action) {
        case JOY_ACTION_UP: Menu_MoveUp(); break;
        case JOY_ACTION_DOWN: Menu_MoveDown(); break;
        case JOY_ACTION_SELECT: Menu_Select(); break;
        default: break;
    }
}

void ProcessGameInput(void) {
    if (g_currentScreen == SCREEN_PAUSED) {
        /* Joystick pentru navigare */
        Joystick_Process();
        int16_t joy_y = Joystick_GetY_Percent();

        static bool pause_nav_consumed = false;
        if (joy_y > 20 && !pause_nav_consumed) {
            g_pause_selection = 1;           // jos -> Exit
            pause_nav_consumed = true;
            g_needsRedraw = 1;
        } else if (joy_y < -20 && !pause_nav_consumed) {
            g_pause_selection = 0;           // sus -> Resume
            pause_nav_consumed = true;
            g_needsRedraw = 1;
        } else if (joy_y > -30 && joy_y < 30) {
            pause_nav_consumed = false;
        }

        /* Remote pentru navigare + select (UP/DOWN/OK) */
        JoyAction_t ir_action = IR_GetMenuAction();
        if (ir_action == JOY_ACTION_UP) {
            g_pause_selection = 0;           // Resume
            g_needsRedraw = 1;
        } else if (ir_action == JOY_ACTION_DOWN) {
            g_pause_selection = 1;           // Exit
            g_needsRedraw = 1;
        }

        bool select_pressed = false;

        /* Joystick buton -> select */
        if (g_joy_btn_pressed) {
            g_joy_btn_pressed = false;
            select_pressed = true;
        }

        /* Remote OK/POWER -> select (via IR_GetMenuAction) */
        if (ir_action == JOY_ACTION_SELECT) {
            select_pressed = true;
        }

        if (select_pressed) {
            if (g_pause_selection == 0) {
                g_currentScreen = SCREEN_GAMEPLAY;
                game.is_paused = 0;
                Game_DrawField();
                Game_DrawScore();
                PRINTF("[GAME] Resumed\r\n");
            } else {
                game.is_running = 0;
                g_currentScreen = SCREEN_MAIN;
                g_menuState.selectedIndex = 0;
                g_needsRedraw = 1;
                PRINTF("[GAME] Exited to menu\r\n");
            }
        }

    } else if (g_currentScreen == SCREEN_GAMEPLAY) {
        /* Verifica pauza mai intai */
        bool pause_pressed = false;
        if (g_joy_btn_pressed) {
            g_joy_btn_pressed = false;
            pause_pressed = true;
        }
        if (IR_CheckPauseOnly()) {
            pause_pressed = true;
        }

        if (pause_pressed) {
            g_currentScreen = SCREEN_PAUSED;
            game.is_paused = 1;
            g_pause_selection = 0;
            g_needsRedraw = 1;
            PRINTF("[GAME] Paused\r\n");
            return;
        }

        /* Proceseaza IR pentru miscare paleta in gameplay */
        IR_ProcessGameInput();
    }
}


/*============================================================================
 * MAIN
 *============================================================================*/

int main(void) {
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
    BOARD_InitDebugConsole();

    Timer_Init();

    srand(g_systick_ms ^ 0xDEADBEEF);

    PRINTF("\r\n");
    PRINTF("========================================\r\n");
    PRINTF("   PONG GAME - FRDM-KL25Z + ST7735     \r\n");
    PRINTF("   Joystick + IR Remote + AI Bot       \r\n");
    PRINTF("   === IR FIX + UI TIMERS ===          \r\n");
    PRINTF("========================================\r\n\r\n");

    PRINTF("=== PINOUT ===\r\n");
    PRINTF("DISPLAY: BL->3.3V VCC->3.3V GND->GND\r\n");
    PRINTF("         SCK->PTC5 SDA->PTC6 DC->PTC3\r\n");
    PRINTF("         RES->PTC0 CS->PTC4\r\n");
    PRINTF("JOYSTICK: VRY->PTB1 SW->PTD4\r\n");
    PRINTF("IR: OUT->PTA12\r\n");
    PRINTF("==============\r\n\r\n");

    PRINTF("Initializing display...\r\n");
    ST7735_Init();
    PRINTF("Display OK!\r\n");

    PRINTF("Initializing joystick...\r\n");
    Joystick_Init();
    PRINTF("Joystick OK!\r\n");

    PRINTF("Initializing IR Remote...\r\n");
    IR_Init();
    TPM0_Init();
    PRINTF("IR Remote OK!\r\n\r\n");

    PRINTF("Initializing Gyroscope...\r\n");
	Gyro_Init();
	PRINTF("Gyroscope OK!\r\n\r\n");

    PRINTF("Initializing Arcade LEDs...\r\n");
    LED_Arcade_Init();
    PRINTF("Arcade LEDs OK!\r\n\r\n");

    PRINTF("Initializing Buzzer...\r\n");
    Buzzer_Init();
    PRINTF("Buzzer OK!\r\n\r\n");

    PRINTF("Initializing PIT timers...\r\n");
    PIT_Init();
    PRINTF("PIT timers OK!\r\n\r\n");


